{
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.2,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "dtype": "float32",
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot",
    "1": "Corn_(maize)___Common_rust_",
    "2": "Corn_(maize)___Northern_Leaf_Blight",
    "3": "Corn_(maize)___healthy",
    "4": "Grape___Black_rot",
    "5": "Grape___Esca_(Black_Measles)",
    "6": "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)",
    "7": "Grape___healthy",
    "8": "Pepper,_bell___Bacterial_spot",
    "9": "Pepper,_bell___healthy",
    "10": "Potato___Early_blight",
    "11": "Potato___Late_blight",
    "12": "Potato___healthy",
    "13": "Tomato___Bacterial_spot",
    "14": "Tomato___Early_blight",
    "15": "Tomato___Late_blight",
    "16": "Tomato___Leaf_Mold",
    "17": "Tomato___Septoria_leaf_spot",
    "18": "Tomato___Tomato_Yellow_Leaf_Curl_Virus",
    "19": "Tomato___healthy"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot": 0,
    "Corn_(maize)___Common_rust_": 1,
    "Corn_(maize)___Northern_Leaf_Blight": 2,
    "Corn_(maize)___healthy": 3,
    "Grape___Black_rot": 4,
    "Grape___Esca_(Black_Measles)": 5,
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": 6,
    "Grape___healthy": 7,
    "Pepper,_bell___Bacterial_spot": 8,
    "Pepper,_bell___healthy": 9,
    "Potato___Early_blight": 10,
    "Potato___Late_blight": 11,
    "Potato___healthy": 12,
    "Tomato___Bacterial_spot": 13,
    "Tomato___Early_blight": 14,
    "Tomato___Late_blight": 15,
    "Tomato___Leaf_Mold": 16,
    "Tomato___Septoria_leaf_spot": 17,
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": 18,
    "Tomato___healthy": 19
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "transformers_version": "5.4.0",
  "use_cache": false
}
